Repository: AndreuMB/andreumb.github.io
Catalog: src/locales/*/messages.po
Languages: es

source: like Next.js, NestJS and Vue.js
es: como Next.js, NestJS y Vue.js.

source: About me
es: Sobre mí

source: An honest presentation :)
es: Una presentación honesta :)

source: and
es: y

source: and can speak in conversational
es: tengo un nivel conversacional en

source: and check it on GitHub
es: y míralo en GitHub

source: and the released games on my
es: y los juegos publicados en mi

source: Best Score
es: Record

source: Catalan (Valencià)
es: Valenciano

source: Click the images to visit their site!
es: ¡Haz clic en las imágenes para visitar su web!

source: Comfortable using
es: Estoy cómodo usando programas de

source: Connect with me!
es: Conecta conmigo!

source: Contact
es: Contacto

source: Create and share music sheets with the world. This was my final degree project in 2022, and I was very proud of it.
es: Crea y comparte partituras con el mundo. Este fue mi proyecto final de grado en 2022, y estaba muy orgulloso de él.

source: databases, including Firebase and Supabase.
es: incluyendo Firebase y Supabase.

source: Do you like what you read? send me an email at
es: Te gusta lo que lees? Envíame un email a

source: Do you want to test your typing skills and know something more about me? Maybe you find some secrets ;).
es: Quieres poner a prueba tus habilidades de escritura y conocer algo más sobre mí? Quizá descubras algún secreto ;).

source: Don't be shy, feel free to reach out, I will be glad to answer.
es: No seas tímid@, siéntete libre de contactarme, estaré encantado de responder.

source: Drawing characters
es: Dibujar personajes

source: Easy! Just click the box below and start typing the sentence shown above it. Click outside to save the score.
es: Fácil! Haz clic en el cuadro y comienza a escribir la frase indicada. Haz clic fuera de este para guardar la puntuación.

source: Email me!
es: Contáctame!

source: English
es: Inglés

source: Even if my focus is in programming I made models in <0>Blender</0> and texture them with Blender/Substance
es: Aunque me centre en programación, he creado modelos en <0>Blender</0> y texturizado usando Blender/Substance

source: frontend development
es: desarrollo frontend

source: Fun
es: Aburrido?

source: Game development
es: Desarrollo de videojuegos

source: Generates random chord progressions based on the scale you select, useful if you want to write songs! Check it on github
es: Genera progresiones de acordes aleatorias según la escala que elijas, útil si quieres componer canciones. Échale un vistazo en GitHub

source: GRADUATED
es: GRADUADO

source: here
es: aquí

source: Hey! I'm Andreu, a web developer and a game developer in process!
es: Hola! Soy Andreu, desarrollador web y de videojuegos.

source: Hi! I'm Andreu
es: Hola! Soy Andreu

source: Higher Education on Web Development
es: Formación Superior en Desarrollo Web

source: Hope you have fun!
es: Aprendiste algo interesante?

source: I did <0>multiplayer</0> projects using Netcode and <1>VR/AR</1> projects with XRTools and Vuforia
es: He trabajado en proyectos <0>multijugador</0> usando Netcode y en proyectos de <1>VR/AR</1> con XR Tools y Vuforia

source: I have a few years of working experience developing web apps and games and I'm still having a lot of fun programming. I'm excited to keep learning and building new things!
es: Tengo experiencia en el desarrollo de aplicaciones web y juegos multiplataforma y sigo disfrutando de la programación como el primer día. Emocionado por seguir aprendiendo y trabajar en proyectos nuevos!

source: I have native fluency in
es: Mis idiomas nativos son

source: I have some projects on <0>Godot</0> too, where I learned the basics of it and GDscript
es: También tengo proyectos en <0>Godot</0>, donde aprendí sus bases y GDScript

source: I know my things around modern
es: Me manejo en

source: I strongly recommend to use a device whith a larger screen
es: Recomiendo utilizar un dispositivo con una pantalla más amplia

source: I used their official tutorial game, end up preatty well. You can even check the trailer I made
es: Usé el juego que utilizan como guia para aprender y quedó bastante bien. Incluso puedes ver el tráiler que hice

source: I've handled both
es: He trabajado con bases de datos

source: It's cool to see how much I've grown since then. Check it out on GitHub
es: Es genial ver cuánto he mejorado desde entonces. Échale un vistazo en GitHub

source: Jump above the Creeps and squash them, but don't let them squash you! Game made in Godot to learn the basics of it.
es: Salta sobre los Creeps y aplástalos, ¡pero no dejes que ellos te aplasten! Juego hecho en Godot para aprender lo básico.

source: LANGUAGE PROFICIENCY
es: IDIOMAS

source: Mobile Device Detected
es: Dispositivo móvil detectado

source: Most of my experience is in <0>Unity</0> where I developed all kind of games
es: La mayor parte de mi experiencia es con <0>Unity</0>, donde desarrollé todo tipo de juegos

source: Organize, track, and share your video game journey. Fun project made with Vue.js with a cute BeeStyle. Check it on github
es: Organiza, registra y comparte tu progreso en videojuegos. Proyecto divertido hecho con Vue.js y un adorable estilo BeeStyle. Échale un vistazo en GitHub

source: OTHER INTERESTS
es: OTROS INTERESES

source: Passionate guitar player
es: Disfruto tocando la guitarra

source: Play as a dwarf and farm crystals to claim your deepest desire. Made with Unity, the game engine I've used the most.
es: Juega como un enano y cultiva cristales para cumplir tu deseo más profundo. Hecho con Unity, el motor de juego que más he usado.

source: PORTFOLIO
es: PORTAFOLIO

source: Portrait
es: Retrato

source: Post Degree on Game Development
es: Especialización en desarrollo de videojuegos

source: Projects
es: Proyectos

source: SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO! SAY HELLO!
es: ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA! ¡DI HOLA!

source: Score
es: Puntuación

source: Some of my work
es: Algunos de mis trabajos

source: Spanish
es: Español

source: Talk with me!
es: ¡Habla conmigo!

source: This days I am focused on
es: Actualmente estoy centrado en

source: This game was showcased at IES Simarro's conference as my final master's project. Check it out on GitHub
es: Este juego fue presentado en la conferencia del IES Simarro como mi proyecto final de máster. Échale un vistazo en GitHub

source: TOOLS
es: HERRAMIENTAS

source: version control
es: control de versiones

source: Volleyball
es: Jugar a voleibol

source: Warframe addict
es: Proplayer de Warframe

source: You can check all the projects on my
es: Puedes ver todos los proyectos en mi

source: You can check my Game Developer resume here!
es: Puedes leer mi CV de Game Developer aquí!

source: You can check my Web Developer resume here!
es: Puedes leer mi CV de Web Developer aquí!

source: You can send me an email at
es: Puedes enviarme un correo a
